import * as Styled from "./WorkoutStyles";
export function WorkoutPage = () => {
    return (
        <>
        <Styled.Center>
  <Styled.TopMenu>
       
           
        
        </Styled.TopMenu>
        <div class="top__lesson">
            <svg width="1160" height="310" viewBox="0 0 1160 310" fill="none" xmlns="http://www.w3.org/2000/svg">
                <g clip-path="url(#clip0_94_3)">
                <rect width="1160" height="310" rx="30" fill="#F5F5F5"/>
                <path d="M734.5 204.862C734.5 182.77 752.409 164.862 774.5 164.862V164.862C796.591 164.862 814.5 182.77 814.5 204.862V274.862C814.5 296.953 796.591 314.862 774.5 314.862V314.862C752.409 314.862 734.5 296.953 734.5 274.862V204.862Z" fill="#AD61FF"/>
                <path d="M930.669 13.7283C941.694 -6.11943 966.721 -13.2721 986.568 -2.24769V-2.24769C1006.42 8.77676 1013.57 33.8036 1002.54 53.6514L915.95 209.552C904.925 229.399 879.898 236.552 860.051 225.528V225.528C840.203 214.503 833.05 189.476 844.075 169.628L930.669 13.7283Z" fill="#9A48F1"/>
                <path d="M978.939 95.3596C989.809 75.7871 1014.49 68.7327 1034.06 79.6033V79.6033C1053.63 90.4739 1060.69 115.153 1049.82 134.725L933.82 343.579C922.949 363.152 898.27 370.206 878.698 359.336V359.336C859.125 348.465 852.071 323.786 862.941 304.214L978.939 95.3596Z" fill="#AD61FF"/>
                <path d="M977.5 276.862C977.5 254.77 995.409 236.862 1017.5 236.862V236.862C1039.59 236.862 1057.5 254.77 1057.5 276.862V368.862H977.5V276.862Z" fill="#AD61FF"/>
                <g filter="url(#filter0_b_94_3)">
                <path fill-rule="evenodd" clip-rule="evenodd" d="M975.732 0V46.1564C975.709 29.6077 962.286 16.1996 945.732 16.1996H917.466C900.897 16.1996 887.466 29.6311 887.466 46.1997V90.3021C887.449 73.7477 874.024 60.3327 857.466 60.3327H829.2C812.631 60.3327 799.2 73.7642 799.2 90.3327V145.462C799.179 128.91 785.756 115.499 769.2 115.499H763C746.431 115.499 733 128.931 733 145.499V258.932H799.2H887.466L975.732 258.932H1064V0H1130C1146.57 0 1160 13.4315 1160 30V280C1160 296.569 1146.57 310 1130 310H30C13.4315 310 0 296.569 0 280V30C0 13.4315 13.4315 0 30 0H975.732Z" fill="#CDCDCD" fill-opacity="0.1"/>
                </g>
                <g style="mix-blend-mode:multiply" opacity="0.36" filter="url(#filter1_i_94_3)">
                <path fill-rule="evenodd" clip-rule="evenodd" d="M1005.73 -49.9998C989.164 -49.9998 975.732 -36.5683 975.732 -19.9998V258.932H1064V-19.9998C1064 -36.5683 1050.57 -49.9998 1034 -49.9998H1005.73ZM917.466 16.2C900.897 16.2 887.466 29.6315 887.466 46.2V90.3025C887.449 73.748 874.024 60.3331 857.466 60.3331H829.2C812.631 60.3331 799.2 73.7645 799.2 90.3331V145.462C799.179 128.911 785.756 115.499 769.2 115.499H763C746.431 115.499 733 128.931 733 145.499V258.932H799.2L887.466 258.932H975.732V46.2C975.732 29.6315 962.301 16.2 945.732 16.2H917.466Z" fill="white"/>
                </g>
                <path d="M53.616 27.92C53.616 31.504 51.632 32.976 49.072 32.976C46.704 32.976 44.592 31.504 44.592 27.92H39.472C39.472 33.936 43.376 37.52 49.072 37.52C54.832 37.52 58.736 33.936 58.736 27.92H53.616ZM53.808 42L40.624 83.92V42H34.736V90H44.08L57.264 48.08V90H63.152V42H53.808ZM85.635 90.64C94.915 90.64 101.827 83.792 101.827 74C101.827 64.208 94.915 57.36 85.635 57.36C76.355 57.36 69.443 64.208 69.443 74C69.443 83.792 76.355 90.64 85.635 90.64ZM85.635 84.752C80.067 84.752 75.843 80.464 75.843 74C75.843 67.536 80.067 63.248 85.635 63.248C91.203 63.248 95.427 67.536 95.427 74C95.427 80.464 91.203 84.752 85.635 84.752ZM114.536 90V63.888H129.192V58H108.136V90H114.536ZM143.302 90.64C147.91 90.64 152.006 88.848 154.118 84.624V90H160.39V67.6C160.39 60.176 153.99 57.36 147.078 57.36C140.038 57.36 133.382 60.496 133.382 68.752H140.038C140.038 64.592 142.918 62.48 147.078 62.48C150.982 62.48 153.99 64.208 153.99 67.344C153.99 74.64 132.422 67.728 132.422 81.552C132.422 87.888 137.606 90.64 143.302 90.64ZM138.95 81.168C138.95 75.792 148.678 77.136 154.118 74.512V76.816C154.118 82.384 149.51 85.264 144.582 85.264C141.318 85.264 138.95 83.92 138.95 81.168Z" fill="black"/>
                </g>
                <defs>
                <filter id="filter0_b_94_3" x="-29.0373" y="-29.0373" width="1218.07" height="368.075" filterUnits="userSpaceOnUse" color-interpolation-filters="sRGB">
                <feFlood flood-opacity="0" result="BackgroundImageFix"/>
                <feGaussianBlur in="BackgroundImageFix" stdDeviation="14.5187"/>
                <feComposite in2="SourceAlpha" operator="in" result="effect1_backgroundBlur_94_3"/>
                <feBlend mode="normal" in="SourceGraphic" in2="effect1_backgroundBlur_94_3" result="shape"/>
                </filter>
                <filter id="filter1_i_94_3" x="733" y="-49.9998" width="342.998" height="320.932" filterUnits="userSpaceOnUse" color-interpolation-filters="sRGB">
                <feFlood flood-opacity="0" result="BackgroundImageFix"/>
                <feBlend mode="normal" in="SourceGraphic" in2="BackgroundImageFix" result="shape"/>
                <feColorMatrix in="SourceAlpha" type="matrix" values="0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 127 0" result="hardAlpha"/>
                <feOffset dx="12" dy="12"/>
                <feGaussianBlur stdDeviation="6.5"/>
                <feComposite in2="hardAlpha" operator="arithmetic" k2="-1" k3="1"/>
                <feColorMatrix type="matrix" values="0 0 0 0 0.678431 0 0 0 0 0.380392 0 0 0 0 1 0 0 0 0.5 0"/>
                <feBlend mode="normal" in2="shape" result="effect1_innerShadow_94_3"/>
                </filter>
                <clipPath id="clip0_94_3">
                <rect width="1160" height="310" rx="30" fill="white"/>
                </clipPath>
                </defs>
            </svg>
        </div>
        
    </div>
    <div class="for__you">
    <p class="for__you__p">Подойдет для вас, если:</p>
    <div class="for__you__ul">
        <div class="for__you__li">
            <svg width="67" height="67" viewBox="0 0 67 67" fill="none" xmlns="http://www.w3.org/2000/svg">
                <rect width="67" height="67" rx="33.5" fill="#C7E957"/>
                <path d="M32.8989 22.8705C32.8989 25.2705 32.0349 26.2625 29.9549 26.2625H29.1869V28.9505H32.8989V45.7825H36.0989V21.7825H32.8989V22.8705Z" fill="black"/>
                </svg>
                
         <p  class="for__you__li__text">
            Давно хотели <br> попробовать йогу, но <br> не решались начать.
         </p>
        </div>
        <div class="for__you__li">
            <svg width="67" height="67" viewBox="0 0 67 67" fill="none" xmlns="http://www.w3.org/2000/svg">
                <rect width="67" height="67" rx="33.5" fill="#C7E957"/>
                <path d="M39.7705 28.1505C39.7705 23.7345 37.0185 21.4625 33.6265 21.4625C30.1705 21.4625 27.4185 23.7025 27.4185 28.1825V30.2945H30.6185V28.4385C30.6185 25.4305 31.8345 24.4065 33.6265 24.4065C35.3225 24.4065 36.5705 25.4945 36.5705 28.1505C36.5705 34.0065 27.2265 36.5665 27.2265 44.1825V45.7825H40.0905V42.8385H30.6825C31.5145 37.6225 39.7705 34.7745 39.7705 28.1505Z" fill="black"/>
                </svg>
                
            <p class="for__you__li__text">
                Хотите укрепить <br>  позвоночник,<br>  избавиться от болей <br>  в спине и суставах.
            </p>
           </div>
           <div class="for__you__li">
            <svg width="67" height="67" viewBox="0 0 67 67" fill="none" xmlns="http://www.w3.org/2000/svg">
                <rect width="67" height="67" rx="33.5" fill="#C7E957"/>
                <path d="M33.6675 35.0305C35.8435 35.0305 37.2195 36.0865 37.2195 38.7425V39.4465C37.2195 42.0385 35.8435 43.1585 33.6675 43.1585C31.4915 43.1585 30.0515 42.0065 30.0515 39.3825V38.2625H26.8515V39.6705C26.8515 43.8625 29.8915 46.1025 33.6675 46.1025C37.4115 46.1025 40.4195 43.8625 40.4195 39.7345V38.3265C40.4195 35.7345 39.0435 33.9745 36.9635 33.1105C38.6595 32.2465 39.7795 30.6465 39.7795 28.3745V27.2225C39.7795 23.4785 37.0275 21.4625 33.6675 21.4625C30.2435 21.4625 27.4915 23.4465 27.4915 27.1585V28.3105H30.6915V27.4465C30.6915 25.3025 31.9395 24.4065 33.6675 24.4065C35.3955 24.4065 36.5795 25.3025 36.5795 27.5105V28.4705C36.5795 30.8385 35.4595 31.8305 33.6675 31.8305H31.8755V35.0305H33.6675Z" fill="black"/>
                </svg>
                
            <p class="for__you__li__text">
                Ищете активность,<br>  полезную для тела <br>  и души.
            </p>
           </div>
    </div>
    </div>
    <div class="areas">
        <p>Направления:</p>
        <div class="areas__ul">
        <ul class="areas__li">
            <li>Йога для новичков</li>
            <li>Классическая йога</li>
            <li>Йогатерапия</li>
        </ul>
        <ul class="areas__li">
            <li>Кундалини-йога</li>
            <li>Хатха-йога</li>
            <li>Аштанга-йога</li> 
        </ul>
    </div>
    </div>
    <div class="footer">
    <p class="footer__text">Благодаря комплексному воздействию упражнений происходит проработка всех групп мышц, <br> тренировка суставов, улучшается циркуляция крови. Кроме того, упражнения дарят отличное <br> настроение, заряжают бодростью и помогают противостоять стрессам.</p>
    <div class="application">
       
    <div class="application__text">
     <p>Оставьте заявку на пробное занятие, мы свяжемся <br>
        с вами, поможем с выбором направления и тренера,<br> с которым тренировки принесут здоровье и радость!</p>
        <button class="application_button">Записаться на тренировку</button>
    </div>
    <div class="application__picture">
        
            
    </div>
    </div>
   
    </Styled.Center>
    </>
);
};
    
  
